---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternLinesStyle
source: html/5ec13bc0-0060-8486-ff2a-201c652b747b.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DividedSurfacePatternLinesStyle Property

"Pattern Lines Style"

## Syntax (C#)
```csharp
public static ForgeTypeId DividedSurfacePatternLinesStyle { get; }
```